{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,34],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.6,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":34,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense2",0,0]]},"keras_version":"tfjs-layers 3.13.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.13.0","convertedBy":null,"weightsManifest":[{"paths":["./BenchPressModel.weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization1/gamma","shape":[34],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[34],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[34,34],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[34],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[34,4],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[4],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[34],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[34],"dtype":"float32"}]}]}